In [0]:
!ls

 DSN_Competition.ipynb	     testdemographics.csv   traindemographics.csv
'SampleSubmission (1).csv'   testperf.csv	    trainperf.csv
 submission10.csv	     testprevloans.csv	    trainprevloans.csv
 Test.csv		     Train.csv

In [0]:
import pandas as pd

SampleSub = pd.read_csv('SampleSubmission (1).csv')
TrainPerf = pd.read_csv('trainperf.csv')
TestPerf = pd.read_csv('testperf.csv')
TrainPrev = pd.read_csv('trainprevloans.csv')
TestPrev = pd.read_csv('testprevloans.csv')
TrainDemographics = pd.read_csv('traindemographics.csv')
TestDemographics = pd.read_csv('testdemographics.csv')

## Join train and test for Customer Demographics, Previous Loans and Performance

In [0]:
Tperformance = pd.concat([TrainPerf, TestPerf]) # We can seperate them later, using the good_bad_flag
# Creating a column to make seperation easier
TrainDemographics['sep'] = 'Train'
TestDemographics['sep'] = 'Test'
Tdemographics = pd.concat([TrainDemographics,TestDemographics])
# Creating a column to make seperation easier
TrainPrev['sep'] = 'Train'
TestPrev['sep'] = 'Test'
Tprev = pd.concat([TrainPrev,TestPrev])

/home/stanley/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:1: FutureWarning: Sorting because non-concatenation axis is not aligned. A future version
of pandas will change to not sort by default.

To accept the future behavior, pass 'sort=True'.

To retain the current behavior and silence the warning, pass sort=False

  """Entry point for launching an IPython kernel.

## Previous Loans

In [0]:
Tprev.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate,sep
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,10000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000,Train
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,10000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000,Train
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,20000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000,Train
3,8a8588f35438fe12015444567666018e,301861541,5,2017-04-09 18:25:55.000000,2017-04-09 17:25:42.000000,10000.0,11500.0,15,2017-04-24 01:35:52.000000,NaN,2017-04-24 00:00:00.000000,2017-04-24 00:48:43.000000,Train
4,8a85890754145ace015429211b513e16,301941754,2,2017-06-17 09:29:57.000000,2017-06-17 08:29:50.000000,10000.0,11500.0,15,2017-07-14 21:18:43.000000,NaN,2017-07-03 00:00:00.000000,2017-07-14 21:08:35.000000,Train

### Picking out TotalProfit features

In [0]:
# First, we get the profit for each loans in the record
Tprev['TotalProfit']=Tprev.totaldue-Tprev.loanamount
Tprev.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate,sep,TotalProfit
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,10000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000,Train,3000.0
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,10000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000,Train,3000.0
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,20000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000,Train,3800.0
3,8a8588f35438fe12015444567666018e,301861541,5,2017-04-09 18:25:55.000000,2017-04-09 17:25:42.000000,10000.0,11500.0,15,2017-04-24 01:35:52.000000,NaN,2017-04-24 00:00:00.000000,2017-04-24 00:48:43.000000,Train,1500.0
4,8a85890754145ace015429211b513e16,301941754,2,2017-06-17 09:29:57.000000,2017-06-17 08:29:50.000000,10000.0,11500.0,15,2017-07-14 21:18:43.000000,NaN,2017-07-03 00:00:00.000000,2017-07-14 21:08:35.000000,Train,1500.0

In [0]:
# Then we get the total profit the bank makes on each customer, based on their id
for i in Tprev.customerid.unique():
    mask= Tprev.customerid==i
    summation=sum(Tprev.loc[mask,'TotalProfit'])
    Tprev.loc[mask,'TotalProfit']=summation

### Get total Loan amounts for each customer

In [0]:
for i in Tprev.customerid.unique():
    mask= Tprev.customerid==i
    summation=sum(Tprev.loc[mask,'loanamount'])
    Tprev.loc[mask,'loanamount']=summation

In [0]:
Tprev.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate,sep,TotalProfit
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,200000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000,Train,42900.0
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,200000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000,Train,42900.0
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,200000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000,Train,42900.0
3,8a8588f35438fe12015444567666018e,301861541,5,2017-04-09 18:25:55.000000,2017-04-09 17:25:42.000000,60000.0,11500.0,15,2017-04-24 01:35:52.000000,NaN,2017-04-24 00:00:00.000000,2017-04-24 00:48:43.000000,Train,10500.0
4,8a85890754145ace015429211b513e16,301941754,2,2017-06-17 09:29:57.000000,2017-06-17 08:29:50.000000,20000.0,11500.0,15,2017-07-14 21:18:43.000000,NaN,2017-07-03 00:00:00.000000,2017-07-14 21:08:35.000000,Train,4500.0

### Picking out no_late_payment, average_payment_days, Most recent payment (Late or Early)

#### Get each customers most recent payment (Late or Early)

In [0]:
# Sort the previous loans based on their customerid and loannumber, get customerid, approveddate and closeddate, drop duplicate customerids and keep the last
Arrangeddate=Tprev.sort_values(by=['customerid','loannumber'])[['customerid','approveddate','closeddate']].drop_duplicates(subset=['customerid'], keep='last')

In [0]:
# Get how long the customer took before paying back for the last loan
Arrangeddate['Last_pay_interval']=Arrangeddate['closeddate'].astype('datetime64')-Arrangeddate['approveddate'].astype('datetime64')
Arrangeddate.head()

,customerid,approveddate,closeddate,Last_pay_interval
1893,8a1088a0484472eb01484669e3ce4e0b,2017-07-02 19:19:01.000000,2017-07-24 20:50:43.000000,22 days 01:31:42
16602,8a1a1e7e4f707f8b014f797718316cad,2017-06-21 22:09:51.000000,2017-07-26 19:48:11.000000,34 days 21:38:20
12199,8a1a32fc49b632520149c3b8fdf85139,2017-06-13 11:02:36.000000,2017-07-13 18:45:26.000000,30 days 07:42:50
6990,8a1eb5ba49a682300149c3c068b806c7,2017-05-23 08:25:46.000000,2017-07-12 13:02:44.000000,50 days 04:36:58
10637,8a1edbf14734127f0147356fdb1b1eb2,2017-06-05 17:01:03.000000,2017-06-27 18:13:52.000000,22 days 01:12:49

In [0]:
# Get only the number of days and convert to int64
Arrangeddate['Last_pay_interval']=Arrangeddate['Last_pay_interval'].apply(lambda x:str(x)[:2])
Arrangeddate['Last_pay_interval']=Arrangeddate['Last_pay_interval'].astype('int64')

In [0]:
# Merge with the previous loans table, based on customerid
Tprev=Tprev.join(Arrangeddate[['Last_pay_interval','customerid']].set_index('customerid'),on='customerid',how='inner')

In [0]:
# Get pay interval of each loan
Tprev['Avg_pay_interval']=Tprev['closeddate'].astype('datetime64')-Tprev['approveddate'].astype('datetime64')
Tprev['Avg_pay_interval']=Tprev['Avg_pay_interval'].apply(lambda x:str(x)[:2])
Tprev['Avg_pay_interval']=Tprev['Avg_pay_interval'].astype('int64')

In [0]:
# Find the average pay interval for each unique customer
for i in Tprev.customerid.unique():
    mask= Tprev.customerid==i
    average_pay_interval=Tprev.loc[mask,'Avg_pay_interval'].mean()
    Tprev.loc[mask,'Avg_pay_interval']=average_pay_interval

In [0]:
Tprev.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate,sep,TotalProfit,Last_pay_interval,Avg_pay_interval,Last_pay
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,200000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000,Train,42900.0,26,29.454545,0
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,200000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000,Train,42900.0,26,29.454545,0
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,200000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000,Train,42900.0,26,29.454545,0
55,8a2a81a74ce8c05d014cfb32a0da1049,301923941,10,2017-06-01 13:34:30.000000,2017-06-01 12:34:21.000000,200000.0,24500.0,30,2017-06-25 15:24:06.000000,NaN,2017-07-03 00:00:00.000000,2017-06-25 15:13:56.000000,Train,42900.0,26,29.454545,0
56,8a2a81a74ce8c05d014cfb32a0da1049,301954468,11,2017-06-28 10:58:34.000000,2017-06-28 09:58:25.000000,200000.0,24500.0,30,2017-07-25 08:14:36.000000,NaN,2017-07-31 00:00:00.000000,2017-07-25 08:04:27.000000,Train,42900.0,26,29.454545,0

In [0]:
# 0 if the customer paid his last loan early, 1 if late
Tprev['Last_pay']=(Tprev['termdays']-Tprev['Last_pay_interval']).apply(lambda x:1 if x<1 else 0)

#### No of Late Payment

In [0]:
# No of days taken before customer paid
Tprev['Timeinterval']=Tprev.closeddate.astype('datetime64')-Tprev.approveddate.astype('datetime64')
Tprev['Timeinterval']=Tprev.Timeinterval.apply(lambda x:int(str(x)[:2]))
Tprev.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate,sep,TotalProfit,Last_pay_interval,Avg_pay_interval,Last_pay,Timeinterval
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,200000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000,Train,42900.0,26,29.454545,0,16
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,200000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000,Train,42900.0,26,29.454545,0,29
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,200000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000,Train,42900.0,26,29.454545,0,52
55,8a2a81a74ce8c05d014cfb32a0da1049,301923941,10,2017-06-01 13:34:30.000000,2017-06-01 12:34:21.000000,200000.0,24500.0,30,2017-06-25 15:24:06.000000,NaN,2017-07-03 00:00:00.000000,2017-06-25 15:13:56.000000,Train,42900.0,26,29.454545,0,24
56,8a2a81a74ce8c05d014cfb32a0da1049,301954468,11,2017-06-28 10:58:34.000000,2017-06-28 09:58:25.000000,200000.0,24500.0,30,2017-07-25 08:14:36.000000,NaN,2017-07-31 00:00:00.000000,2017-07-25 08:04:27.000000,Train,42900.0,26,29.454545,0,26

In [0]:
# Get no of late payments
Tprev['No_late_payment']=(Tprev['termdays']-Tprev['Timeinterval'])
for i in Tprev.customerid.unique():
    mask= Tprev.customerid==i
    late_no=len([x for x in list(Tprev.loc[mask,'No_late_payment']) if x>=1])
    Tprev.loc[mask,'No_late_payment']=late_no
Tprev.head()

,customerid,systemloanid,loannumber,approveddate,creationdate,loanamount,totaldue,termdays,closeddate,referredby,firstduedate,firstrepaiddate,sep,TotalProfit,Last_pay_interval,Avg_pay_interval,Last_pay,Timeinterval,No_late_payment
0,8a2a81a74ce8c05d014cfb32a0da1049,301682320,2,2016-08-15 18:22:40.000000,2016-08-15 17:22:32.000000,200000.0,13000.0,30,2016-09-01 16:06:48.000000,NaN,2016-09-14 00:00:00.000000,2016-09-01 15:51:43.000000,Train,42900.0,26,29.454545,0,16,7
1,8a2a81a74ce8c05d014cfb32a0da1049,301883808,9,2017-04-28 18:39:07.000000,2017-04-28 17:38:53.000000,200000.0,13000.0,30,2017-05-28 14:44:49.000000,NaN,2017-05-30 00:00:00.000000,2017-05-26 00:00:00.000000,Train,42900.0,26,29.454545,0,29,7
2,8a2a81a74ce8c05d014cfb32a0da1049,301831714,8,2017-03-05 10:56:25.000000,2017-03-05 09:56:19.000000,200000.0,23800.0,30,2017-04-26 22:18:56.000000,NaN,2017-04-04 00:00:00.000000,2017-04-26 22:03:47.000000,Train,42900.0,26,29.454545,0,52,7
55,8a2a81a74ce8c05d014cfb32a0da1049,301923941,10,2017-06-01 13:34:30.000000,2017-06-01 12:34:21.000000,200000.0,24500.0,30,2017-06-25 15:24:06.000000,NaN,2017-07-03 00:00:00.000000,2017-06-25 15:13:56.000000,Train,42900.0,26,29.454545,0,24,7
56,8a2a81a74ce8c05d014cfb32a0da1049,301954468,11,2017-06-28 10:58:34.000000,2017-06-28 09:58:25.000000,200000.0,24500.0,30,2017-07-25 08:14:36.000000,NaN,2017-07-31 00:00:00.000000,2017-07-25 08:04:27.000000,Train,42900.0,26,29.454545,0,26,7

### Delete irreleveant columns

In [0]:
newTprev=Tprev.drop(columns=['firstrepaiddate','totaldue', 'loannumber', 'firstduedate','approveddate','termdays','creationdate','systemloanid','closeddate', 'Timeinterval', 'Last_pay_interval'])

## Get just one occurence of each customer (since each column contains the total for each customer)

In [0]:
newTprev.rename(columns={"loanamount":"loanamount_sum"},inplace=True)
newTprev.head()

,customerid,loanamount_sum,referredby,sep,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment
0,8a2a81a74ce8c05d014cfb32a0da1049,200000.0,NaN,Train,42900.0,29.454545,0,7
1,8a2a81a74ce8c05d014cfb32a0da1049,200000.0,NaN,Train,42900.0,29.454545,0,7
2,8a2a81a74ce8c05d014cfb32a0da1049,200000.0,NaN,Train,42900.0,29.454545,0,7
55,8a2a81a74ce8c05d014cfb32a0da1049,200000.0,NaN,Train,42900.0,29.454545,0,7
56,8a2a81a74ce8c05d014cfb32a0da1049,200000.0,NaN,Train,42900.0,29.454545,0,7

In [0]:
newTprev.drop_duplicates(subset=['customerid'],keep='last',inplace=True)

In [0]:
# 1 if customer wasn't referred, else 0 (Might not be needed)
newTprev['referredby']=newTprev.referredby.isnull().apply(lambda x:1 if x is True else 0)
newTprev.head()

,customerid,loanamount_sum,referredby,sep,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment
1744,8a2a81a74ce8c05d014cfb32a0da1049,200000.0,1,Train,42900.0,29.454545,0,7
1745,8a8588f35438fe12015444567666018e,60000.0,1,Train,10500.0,18.166667,0,5
1746,8a85890754145ace015429211b513e16,20000.0,1,Train,4500.0,31.500000,0,0
1748,8a858970548359cc0154883481981866,150000.0,1,Train,38400.0,27.000000,0,8
1750,8a8589f35451855401546b0738c42524,100000.0,1,Train,24800.0,24.857143,1,4

## Performance

In [0]:
Tperformance.head()

,approveddate,creationdate,customerid,good_bad_flag,loanamount,loannumber,referredby,systemloanid,termdays,totaldue
0,2017-07-25 08:22:56.000000,2017-07-25 07:22:47.000000,8a2a81a74ce8c05d014cfb32a0da1049,Good,30000.0,12,1,301994762,30,34500.0
1,2017-07-05 17:04:41.000000,2017-07-05 16:04:18.000000,8a85886e54beabf90154c0a29ae757c0,Good,15000.0,2,1,301965204,30,17250.0
2,2017-07-06 14:52:57.000000,2017-07-06 13:52:51.000000,8a8588f35438fe12015444567666018e,Good,20000.0,7,1,301966580,15,22250.0
3,2017-07-27 19:00:41.000000,2017-07-27 18:00:35.000000,8a85890754145ace015429211b513e16,Good,10000.0,3,1,301999343,15,11500.0
4,2017-07-03 23:42:45.000000,2017-07-03 22:42:39.000000,8a858970548359cc0154883481981866,Good,40000.0,9,1,301962360,30,44000.0

In [0]:
Tperformance['referredby']=Tperformance.referredby.isnull().apply(lambda x:1 if x is True else 0)

In [0]:
# Merge info from Previous Loans to Performance
result = pd.merge(newTprev.reset_index(), Tperformance.reset_index(),on=['customerid'], how='outer')
result.head()

,index_x,customerid,loanamount_sum,referredby_x,sep,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment,index_y,approveddate,creationdate,good_bad_flag,loanamount,loannumber,referredby_y,systemloanid,termdays,totaldue
0,1744.0,8a2a81a74ce8c05d014cfb32a0da1049,200000.0,NaN,Train,42900.0,29.454545,0.0,7.0,0,2017-07-25 08:22:56.000000,2017-07-25 07:22:47.000000,Good,30000.0,12,0,301994762,30,34500.0
1,1745.0,8a8588f35438fe12015444567666018e,60000.0,NaN,Train,10500.0,18.166667,0.0,5.0,2,2017-07-06 14:52:57.000000,2017-07-06 13:52:51.000000,Good,20000.0,7,0,301966580,15,22250.0
2,1746.0,8a85890754145ace015429211b513e16,20000.0,NaN,Train,4500.0,31.500000,0.0,0.0,3,2017-07-27 19:00:41.000000,2017-07-27 18:00:35.000000,Good,10000.0,3,0,301999343,15,11500.0
3,1748.0,8a858970548359cc0154883481981866,150000.0,NaN,Train,38400.0,27.000000,0.0,8.0,4,2017-07-03 23:42:45.000000,2017-07-03 22:42:39.000000,Good,40000.0,9,0,301962360,30,44000.0
4,1750.0,8a8589f35451855401546b0738c42524,100000.0,NaN,Train,24800.0,24.857143,1.0,4.0,5,2017-07-19 21:46:24.000000,2017-07-19 20:46:18.000000,Good,30000.0,8,0,301986516,60,39000.0

In [0]:
# OR operation (1 if the customer was ever referred, 0 if customer was never referred)
# result['referred']=result.referredby_x+result.referredby_y>=1

In [0]:
result['Profit']=result.totaldue-result.loanamount

In [0]:
# Get total loan amount, total profit and then find the average of both
result['loanamount_sum'] = result.loanamount_sum + result.loanamount
result["Avg_loanamount"] = result.loanamount_sum/result.loannumber
result['TotalProfit'] = result.TotalProfit + result.Profit
result["Avgprofit"] = result['TotalProfit']/result.loannumber

In [0]:
result.dtypes

index_x             float64
customerid           object
loanamount_sum      float64
referredby_x         object
sep                  object
TotalProfit         float64
Avg_pay_interval    float64
Last_pay            float64
No_late_payment     float64
index_y               int64
approveddate         object
creationdate         object
good_bad_flag        object
loanamount          float64
loannumber            int64
referredby_y          int64
systemloanid          int64
termdays              int64
totaldue            float64
Profit              float64
Avg_loanamount      float64
Avgprofit           float64
dtype: object

In [0]:
newResult=result.drop(columns=['referredby_x','referredby_y','sep', 'referred', 'approveddate','creationdate','systemloanid', 'Profit', 'loanamount', "index_x", "index_y"])
newResult.head()

,customerid,loanamount_sum,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment,good_bad_flag,loannumber,termdays,totaldue,Avg_loanamount,Avgprofit
0,8a2a81a74ce8c05d014cfb32a0da1049,230000.0,47400.0,29.454545,0.0,7.0,Good,12,30,34500.0,19166.666667,3950.000000
1,8a8588f35438fe12015444567666018e,80000.0,12750.0,18.166667,0.0,5.0,Good,7,15,22250.0,11428.571429,1821.428571
2,8a85890754145ace015429211b513e16,30000.0,6000.0,31.500000,0.0,0.0,Good,3,15,11500.0,10000.000000,2000.000000
3,8a858970548359cc0154883481981866,190000.0,42400.0,27.000000,0.0,8.0,Good,9,30,44000.0,21111.111111,4711.111111
4,8a8589f35451855401546b0738c42524,130000.0,33800.0,24.857143,1.0,4.0,Good,8,60,39000.0,16250.000000,4225.000000

## Demographics

### Get customer age and then age group

In [0]:
import datetime
Tdemographics['Today']="2018-10-12"
Tdemographics['Age']=(Tdemographics['Today'].astype('datetime64')-Tdemographics['birthdate'].astype('datetime64'))

In [0]:
Tdemographics['Age']=Tdemographics['Age'].apply(lambda x:int(str(x)[:-13].strip()))

In [0]:
Tdemographics['Age']=Tdemographics['Age']//365

In [0]:
Tdemographics.drop(['Today', 'birthdate', 'bank_branch_clients', 'level_of_education_clients'], axis=1, inplace=True)

In [0]:
Tdemographics=Tdemographics.drop_duplicates(subset=['customerid'], keep='last')

In [0]:
Tdemographics.apply(lambda x: sum(x.isnull()))

customerid                     0
bank_account_type              0
longitude_gps                  0
latitude_gps                   0
bank_name_clients              0
employment_status_clients    865
sep                            0
Age                            0
dtype: int64

In [0]:
Tdemographics.bank_account_type.unique()

array(['Savings', 'Other', 'Current'], dtype=object)

In [0]:
# Fill NaN values with 'others'
Tdemographics.employment_status_clients.fillna('Uknown',inplace=True)

In [0]:
# Merge Demographics with Performance
result = pd.merge(newResult.reset_index(), Tdemographics.reset_index(),on=['customerid'], how='outer')

In [0]:
result.drop(columns=['index_y','index_x','index_y'],inplace=True)

In [0]:
result.head()

,customerid,loanamount_sum,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment,good_bad_flag,loannumber,termdays,totaldue,Avg_loanamount,Avgprofit,bank_account_type,longitude_gps,latitude_gps,bank_name_clients,employment_status_clients,sep,Age
0,8a2a81a74ce8c05d014cfb32a0da1049,230000.0,47400.0,29.454545,0.0,7.0,Good,12,30,34500.0,19166.666667,3950.000000,Other,3.432010,6.433055,Diamond Bank,Permanent,Train,46
1,8a8588f35438fe12015444567666018e,80000.0,12750.0,18.166667,0.0,5.0,Good,7,15,22250.0,11428.571429,1821.428571,Other,11.139350,10.292041,EcoBank,Permanent,Train,34
2,8a85890754145ace015429211b513e16,30000.0,6000.0,31.500000,0.0,0.0,Good,3,15,11500.0,10000.000000,2000.000000,Savings,3.985770,7.491708,First Bank,Permanent,Train,41
3,8a858970548359cc0154883481981866,190000.0,42400.0,27.000000,0.0,8.0,Good,9,30,44000.0,21111.111111,4711.111111,Other,7.457913,9.076574,GT Bank,Permanent,Train,32
4,8a8589f35451855401546b0738c42524,130000.0,33800.0,24.857143,1.0,4.0,Good,8,60,39000.0,16250.000000,4225.000000,Savings,3.311982,6.633271,Access Bank,Permanent,Test,45

In [0]:
# Categorize age into 3 groups
result.Age = result.Age.apply(lambda x:0 if x in range(0, 18) else 1 if x in range(18, 35) else 3)

In [0]:
result.apply(lambda x: sum(x.isnull()))

customerid                      0
loanamount_sum                 17
TotalProfit                    17
Avg_pay_interval               17
Last_pay                       17
No_late_payment                17
good_bad_flag                1450
loannumber                      0
termdays                        0
totaldue                        0
Avg_loanamount                 17
Avgprofit                      17
bank_account_type               0
longitude_gps                   0
latitude_gps                    0
bank_name_clients               0
employment_status_clients       0
sep                             0
Age                             0
dtype: int64

In [0]:
# Fill info for new customers with 0

result.TotalProfit.fillna(0,inplace=True)
result.Avg_loanamount.fillna(0,inplace=True)
result.No_late_payment.fillna(0,inplace=True)
result.loanamount_sum.fillna(0,inplace=True)
result.Avg_pay_interval.fillna(0,inplace=True)
result.Last_pay.fillna(0,inplace=True)
result.Avgprofit.fillna(0,inplace=True)

In [0]:
# Change column datatype to int64
result["Last_pay"]=result.Last_pay.astype('int64')
result.No_late_payment=result.No_late_payment.astype('int64')

In [0]:
result.dtypes

customerid                    object
loanamount_sum               float64
TotalProfit                  float64
Avg_pay_interval             float64
Last_pay                       int64
No_late_payment                int64
good_bad_flag                 object
loannumber                     int64
termdays                       int64
totaldue                     float64
Avg_loanamount               float64
Avgprofit                    float64
bank_account_type             object
longitude_gps                float64
latitude_gps                 float64
bank_name_clients             object
employment_status_clients     object
sep                           object
Age                            int64
dtype: object

In [0]:
result = result.drop(['longitude_gps','latitude_gps','bank_name_clients', 'sep'],axis=1)

## Creating dummy variables for Categorical Data

In [0]:
#Import library:
from sklearn.preprocessing import LabelEncoder
#New variable for Supermarket
var_mod = ['bank_account_type','employment_status_clients', 'customerid']
le = LabelEncoder()
for i in var_mod:
    result[i] = le.fit_transform(result[i])

In [0]:
#One Hot Coding:
result = pd.get_dummies(result, columns=['bank_account_type', 'employment_status_clients', 'customerid'])

In [0]:
# Separate train and test data
Train=result.loc[result.good_bad_flag.notnull()]
Test=result.loc[result.good_bad_flag.isnull()]

In [0]:
Train.good_bad_flag.unique()

array(['Good', 'Bad'], dtype=object)

In [0]:
# Convert the "good_bad_flag" column to numerical
Train["good_bad_flag"] = Train["good_bad_flag"].map({'Good':1, 'Bad':0})
Train.tail()

/home/stanley/anaconda3/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/indexing.html#indexing-view-versus-copy

,loanamount_sum,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment,good_bad_flag,loannumber,termdays,totaldue,Avg_loanamount,...,customerid_5808,customerid_5809,customerid_5810,customerid_5811,customerid_5812,customerid_5813,customerid_5814,customerid_5815,customerid_5816,customerid_5817
5805,0.0,0.0,0.0,0,0,1,6,30,11000.0,0.0,...,0,0,0,0,0,0,0,0,0,0
5806,0.0,0.0,0.0,0,0,1,2,30,13000.0,0.0,...,0,0,0,0,0,0,0,0,0,0
5807,0.0,0.0,0.0,0,0,0,2,30,13000.0,0.0,...,0,0,0,0,0,0,0,0,0,0
5808,0.0,0.0,0.0,0,0,1,2,15,11500.0,0.0,...,0,0,0,0,0,0,0,0,0,0
5809,0.0,0.0,0.0,0,0,1,2,30,13000.0,0.0,...,0,0,0,0,0,0,0,0,0,0

In [0]:
Train.to_csv('Train.csv',index=False)
Test.to_csv('Test.csv',index=False)

# At this point, Azure is the way forward

## Model Training

In [0]:
import numpy as np # linear algebra
import pandas as pd # data processing, CSV file I/O (e.g. pd.read_csv)
import xgboost as xgb
from sklearn.cross_validation import train_test_split
import matplotlib.pyplot as plt
import seaborn as sns
sns.set()

In [0]:
train = pd.read_csv("Train.csv")
test = pd.read_csv("Test.csv")

In [0]:
train.dtypes

loanamount_sum                 float64
TotalProfit                    float64
Avg_pay_interval               float64
Last_pay                         int64
No_late_payment                  int64
good_bad_flag                    int64
loannumber                       int64
termdays                         int64
totaldue                       float64
Avg_loanamount                 float64
Avgprofit                      float64
Age                              int64
bank_account_type_0              int64
bank_account_type_1              int64
bank_account_type_2              int64
employment_status_clients_0      int64
employment_status_clients_1      int64
employment_status_clients_2      int64
employment_status_clients_3      int64
employment_status_clients_4      int64
employment_status_clients_5      int64
employment_status_clients_6      int64
customerid_0                     int64
customerid_1                     int64
customerid_2                     int64
customerid_3                     int64
customerid_4                     int64
customerid_5                     int64
customerid_6                     int64
customerid_7                     int64
                                ...
customerid_5788                  int64
customerid_5789                  int64
customerid_5790                  int64
customerid_5791                  int64
customerid_5792                  int64
customerid_5793                  int64
customerid_5794                  int64
customerid_5795                  int64
customerid_5796                  int64
customerid_5797                  int64
customerid_5798                  int64
customerid_5799                  int64
customerid_5800                  int64
customerid_5801                  int64
customerid_5802                  int64
customerid_5803                  int64
customerid_5804                  int64
customerid_5805                  int64
customerid_5806                  int64
customerid_5807                  int64
customerid_5808                  int64
customerid_5809                  int64
customerid_5810                  int64
customerid_5811                  int64
customerid_5812                  int64
customerid_5813                  int64
customerid_5814                  int64
customerid_5815                  int64
customerid_5816                  int64
customerid_5817                  int64
Length: 5840, dtype: object

In [0]:
test.drop('good_bad_flag', axis=1, inplace=True)

In [0]:
train.head()

,loanamount_sum,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment,good_bad_flag,loannumber,termdays,totaldue,Avg_loanamount,...,customerid_5808,customerid_5809,customerid_5810,customerid_5811,customerid_5812,customerid_5813,customerid_5814,customerid_5815,customerid_5816,customerid_5817
0,230000.0,47400.0,29.454545,0,7,1,12,30,34500.0,19166.666667,...,0,0,0,0,0,0,0,0,0,0
1,80000.0,12750.0,18.166667,0,5,1,7,15,22250.0,11428.571429,...,0,0,0,0,0,0,0,0,0,0
2,30000.0,6000.0,31.500000,0,0,1,3,15,11500.0,10000.000000,...,0,0,0,0,0,0,0,0,0,0
3,190000.0,42400.0,27.000000,0,8,1,9,30,44000.0,21111.111111,...,0,0,0,0,0,0,0,0,0,0
4,130000.0,33800.0,24.857143,1,4,1,8,60,39000.0,16250.000000,...,0,0,0,0,0,0,0,0,0,0

In [0]:
importantcols=[x for x in train.columns if x not in ['good_bad_flag']]
y = train[["good_bad_flag"]]
X = train[importantcols]

In [0]:
# X = X.astype(np.float32)
# offset = int(X.shape[0] * 0.9)
# X_train, y_train = X[:offset], y[:offset]
# X_test, y_test = X[offset:], y[offset:]
y.head()

   good_bad_flag
0              1
1              1
2              1
3              1
4              1

In [0]:
#Split the dataset into train and Test
seed = 7
test_size = 0.3
X_train, X_test, y_train, y_test = train_test_split(X, y, test_size=test_size, random_state=seed)

## XGboost

In [0]:
#Train the XGboost Model for Classification
model1 = xgb.XGBClassifier()
train_model1 = model1.fit(X_train, y_train)

/home/stanley/anaconda3/lib/python3.6/site-packages/sklearn/preprocessing/label.py:95: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)
/home/stanley/anaconda3/lib/python3.6/site-packages/sklearn/preprocessing/label.py:128: DataConversionWarning: A column-vector y was passed when a 1d array was expected. Please change the shape of y to (n_samples, ), for example using ravel().
  y = column_or_1d(y, warn=True)

In [0]:
#prediction and Classification Report
from sklearn.metrics import classification_report
pred1 = train_model1.predict(X_test)
print('Model 1 XGboost Report %r' % (classification_report(y_test, pred1)))

Model 1 XGboost Report '             precision    recall  f1-score   support\n\n          0       0.60      0.15      0.24       284\n          1       0.81      0.97      0.88      1027\n\navg / total       0.76      0.79      0.74      1311\n'

/home/stanley/anaconda3/lib/python3.6/site-packages/sklearn/preprocessing/label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

In [0]:
#Let's use accuracy score
from sklearn.metrics import accuracy_score
print("Accuracy for model 1: %.2f" % (accuracy_score(y_test, pred1) * 100))

Accuracy for model 1: 79.41

## Predict

In [0]:
predict1 = train_model1.predict(test[importantcols])

/home/stanley/anaconda3/lib/python3.6/site-packages/sklearn/preprocessing/label.py:151: DeprecationWarning: The truth value of an empty array is ambiguous. Returning False, but in future this will result in an error. Use `array.size > 0` to check that an array is not empty.
  if diff:

In [0]:
predict1

array([1, 1, 1, ..., 1, 1, 1])

In [0]:
test["Good_Bad_flag"] = predict1

In [0]:
test.head()

,loanamount_sum,TotalProfit,Avg_pay_interval,Last_pay,No_late_payment,loannumber,termdays,totaldue,Avg_loanamount,Avgprofit,...,customerid_5809,customerid_5810,customerid_5811,customerid_5812,customerid_5813,customerid_5814,customerid_5815,customerid_5816,customerid_5817,Good_Bad_flag
0,36000.0,9150.0,28.333333,1,1,4,30,12250.0,9000.000000,2287.500000,...,0,0,0,0,0,0,0,0,0,1
1,255000.0,37400.0,24.111111,0,7,10,30,44000.0,25500.000000,3740.000000,...,0,0,0,0,0,0,0,0,0,1
2,85000.0,19175.0,31.200000,0,2,6,30,24500.0,14166.666667,3195.833333,...,0,0,0,0,0,0,0,0,0,1
3,150000.0,19900.0,13.428571,1,7,8,30,34500.0,18750.000000,2487.500000,...,0,0,0,0,0,0,0,0,0,1
4,50000.0,12000.0,21.666667,1,3,4,30,24500.0,12500.000000,3000.000000,...,0,0,0,0,0,0,0,0,0,1

In [0]:
submission = pd.read_csv("SampleSubmission (1).csv")
submission.head()

                         customerid  Good_Bad_flag
0  8a28afc7474813a40147639ec637156b              1
1  8a3735d5518aba7301518ac34413010d              1
2  8a76e7d443e6e97c0143ed099d102b1d              1
3  8a818823525dceef01525deda2480384              1
4  8a818926522ea5ef01523aff15c37482              1

In [0]:
submission["Good_Bad_flag"] = test["Good_Bad_flag"]

In [0]:
submission.tail()

                            customerid  Good_Bad_flag
1445  8a858fff5a36fe68015a3744f0021e89              1
1446  8aaae7a74400b28201441c8b62514150              1
1447  8aab10f748cf78ff0148d11fac1447a6              1
1448  8aab160f499477da014999ba2f0f578b              1
1449  8addcb0645aff34b0145b25fe1616ee0              1

In [0]:
submission.to_csv('submission.csv',index=False)